app/controllers/authentication_controller.rb

  def login
    @user = User.find_by(email: login_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jacky@email.com"], ["LIMIT", 1]]