app/controllers/great_things_controller.rb

  def index
    @great_things = GreatThing.where(user_id: params[:user_id])
---
SELECT "great_things".* FROM "great_things" WHERE "great_things"."user_id" = $1  [["user_id", 1]]