app/controllers/great_things_controller.rb

  def index
    @great_things = GreatThing.all
---
SELECT "great_things".* FROM "great_things"

  def create
    @great_thing = GreatThing.new(great_thing_params)
    @user = User.find(params[:user_id])
    @great_thing.user = @user

    if @great_thing.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "great_things" ("content", "date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "finish part 1"], ["date", ""], ["created_at", "2020-07-16 18:23:19.710736"], ["updated_at", "2020-07-16 18:23:19.710736"], ["user_id", 1]]

  def update
    if @great_thing.update(great_thing_params)
---
UPDATE "great_things" SET "date" = $1, "updated_at" = $2 WHERE "great_things"."id" = $3  [["date", "July 15, 2020"], ["updated_at", "2020-07-16 18:31:04.229978"], ["id", 5]]

    def set_great_thing
      @great_thing = GreatThing.find(params[:id])
---
SELECT "great_things".* FROM "great_things" WHERE "great_things"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]