app/controllers/to_dos_controller.rb

  def index
    @to_dos = ToDo.where(user_id: params[:user_id])
---
SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def create
    @to_do = ToDo.new(to_do_params)
    @user = User.find(params[:user_id])
    @to_do.user = @user

    if @to_do.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "to_dos" ("content", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "finish part 3"], ["status", "in progress"], ["created_at", "2020-07-17 13:29:37.084633"], ["updated_at", "2020-07-17 13:29:37.084633"], ["user_id", 1]]

  def update
    if @to_do.update(to_do_params)
---
UPDATE "to_dos" SET "content" = $1, "updated_at" = $2 WHERE "to_dos"."id" = $3  [["content", "finish part 1"], ["updated_at", "2020-07-15 20:33:08.251697"], ["id", 1]]

  def destroy
    @to_do.destroy
---
DELETE FROM "to_dos" WHERE "to_dos"."id" = $1  [["id", 2]]

    def set_to_do
      @to_do = ToDo.find_by(user_id: params[:user_id], id:params[:id])
---
SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."user_id" = $1 AND "to_dos"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 40], ["LIMIT", 1]]