app/controllers/to_dos_controller.rb

  def index
    @to_dos = ToDo.all
---
SELECT "to_dos".* FROM "to_dos"

    def set_to_do
      @to_do = ToDo.find(params[:id])
---
SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]